// BSLLS:LineLength-off
#Использовать "../src"
#Использовать asserts
#Использовать logos
#Использовать tempfiles
#Использовать json

Перем Лог;

&Тест
Процедура ТестДолжен_ПроверитьЧтениеXMLВСоответствие() Экспорт
	Лог = Логирование.ПолучитьЛог("oscript.lib.xml-reader-test");
	Лог.УстановитьУровень(УровниЛога.Отладка);

	ФейковыйФайл = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "test-file.xml");
	
	ПроцессорXML = Новый СериализацияДанныхXML();
	
	РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ФейковыйФайл);

	ПоказатьНастройкиВРежимеОтладки(РезультатЧтения);

	Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][0]["ИмяФайла"]["НазваниеФормата"], "fb2", "Результат должен совпадать с ожиданиями.");
	Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][1]["ТипФайла"]["Запрос"]["_Атрибуты"]["name"], "Имя", "Результат должен совпадать с ожиданиями.");
	Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][1]["ТипФайла"]["ОписаниеТиповФайла"], "Внешний", "Результат должен совпадать с ожиданиями.");
	// TODO: Расскоментировать, когда/если движок снова начнет читать комментарии в элементе с под-элементами.
	// Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][1]["ТипФайла"]["_Комментарий"], " <Запрос/> ", "Результат должен совпадать с ожиданиями.");
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьЗаписьXMLИзСоответствия() Экспорт
	
	Лог = Логирование.ПолучитьЛог("oscript.lib.xml-reader-test");
	Лог.УстановитьУровень(УровниЛога.Отладка);

	ФейковыйФайл = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "test-file.xml");
	
	ПроцессорXML = Новый СериализацияДанныхXML();
	
	РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ФейковыйФайл);

	ВременныйФайл = ВременныеФайлы.НовоеИмяФайла("xml");

	ПроцессорXML.ЗаписатьВФайл(РезультатЧтения, ВременныйФайл);

	РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ФейковыйФайл);
	Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][0]["ИмяФайла"]["НазваниеФормата"], "fb2", "Результат должен совпадать с ожиданиями.");
	Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][1]["ТипФайла"]["Запрос"]["_Атрибуты"]["name"], "Имя", "Результат должен совпадать с ожиданиями.");
	Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][1]["ТипФайла"]["ОписаниеТиповФайла"], "Внешний", "Результат должен совпадать с ожиданиями.");
	// TODO: Расскоментировать, когда/если движок снова начнет читать комментарии в элементе с под-элементами.
	// Утверждения.ПроверитьРавенство(РезультатЧтения["ФайлПФР"][1]["ТипФайла"]["_Комментарий"], " <Запрос/> ", "Результат должен совпадать с ожиданиями.");

КонецПроцедуры

&Тест
&Параметры(Истина, "frst:data", "scnd:data")
&Параметры(Ложь, "data", "data")
Процедура ТестДолжен_ПроверитьЧтениеПолныхИменXML(ИспользоватьПолноеИмяУзла, ИмяУзлаПервогоУровня, ИмяУзлаВторогоУровня) Экспорт
	
	Лог = Логирование.ПолучитьЛог("oscript.lib.xml-reader-test");

	ФейковыйФайл = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "test-full-names.xml");
	
	ПроцессорXML = Новый СериализацияДанныхXML();
	
	РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ФейковыйФайл, ИспользоватьПолноеИмяУзла);

	УзелПервогоУровня = РезультатЧтения[ИмяУзлаПервогоУровня];
	Утверждения.ПроверитьНеРавенство(УзелПервогоУровня, Неопределено, "Должен быть найден узел первого уровня");
	
	УзелВторогоУровня = УзелПервогоУровня._Элементы[ИмяУзлаВторогоУровня];
	Утверждения.ПроверитьРавенство(УзелВторогоУровня, "Значение", "Должно быть найдено значение узла второго уровня");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьСохранениеПолныхИменXMLПриПерезаписи() Экспорт
	
	Лог = Логирование.ПолучитьЛог("oscript.lib.xml-reader-test");

	ФейковыйФайл = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "test-rewrite.xml");
	
	ПроцессорXML = Новый СериализацияДанныхXML();
	
	РезультатЧтенияДо = ПроцессорXML.ПрочитатьИзФайла(ФейковыйФайл, Истина);

	ВременныйФайл = ВременныеФайлы.НовоеИмяФайла("xml");

	ПроцессорXML.ЗаписатьВФайл(РезультатЧтенияДо, ВременныйФайл);

	РезультатЧтенияПосле = ПроцессорXML.ПрочитатьИзФайла(ВременныйФайл, Истина);

	Утверждения.ПроверитьРавенство(
		РезультатЧтенияДо["MetaDataObject"]._Атрибуты["xmlns:xr"],
		РезультатЧтенияПосле["MetaDataObject"]._Атрибуты["xmlns:xr"],
		"Значения после перезаписи должны совпадать");

	Утверждения.ПроверитьРавенство(
		РезультатЧтенияДо["MetaDataObject"]._Атрибуты["xmlns:xsi"],
		РезультатЧтенияПосле["MetaDataObject"]._Атрибуты["xmlns:xsi"],
		"Значения после перезаписи должны совпадать");

	Утверждения.ПроверитьРавенство(
		РезультатЧтенияДо["MetaDataObject"]._Элементы["xr:Item"]._Значение,
		РезультатЧтенияПосле["MetaDataObject"]._Элементы["xr:Item"]._Значение,
		"Значения после перезаписи должны совпадать");
	
	Утверждения.ПроверитьРавенство(
		РезультатЧтенияДо["MetaDataObject"]._Элементы["xr:Item"]._Атрибуты["xmlns:xsi"],
		РезультатЧтенияПосле["MetaDataObject"]._Элементы["xr:Item"]._Атрибуты["xmlns:xsi"],
		"Значения после перезаписи должны совпадать");

КонецПроцедуры

Процедура ПоказатьНастройкиВРежимеОтладки(ЗначенияПараметров, Знач Родитель = "") Экспорт
	
	Если Не Лог.Уровень() = УровниЛога.Отладка Тогда
		Возврат;
	КонецЕсли;

	Если Родитель = "" Тогда
		Лог.Отладка("	Тип параметров %1", ТипЗнч(ЗначенияПараметров));
	КонецЕсли;

	Если ТипЗнч(ЗначенияПараметров) = Тип("Массив") Тогда

		Для ИИ = 0 По ЗначенияПараметров.ВГраница() Цикл
			ПоказатьНастройкиВРежимеОтладки(ЗначенияПараметров[ИИ], СтрШаблон("%1.%2", Родитель, ИИ));
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(ЗначенияПараметров) = Тип("Структура")
		ИЛИ ТипЗнч(ЗначенияПараметров) = Тип("Соответствие") Тогда

		Если ЗначенияПараметров.Количество() = 0 Тогда
			Лог.Отладка("	Коллекция параметров пуста для <%1> ", Родитель);
		КонецЕсли;

		Для каждого Элемент Из ЗначенияПараметров Цикл
	
			Если Не ПустаяСтрока(Родитель) Тогда
				ПредставлениеКлюча  = СтрШаблон("%1.%2", Родитель, Элемент.Ключ);
			Иначе
				ПредставлениеКлюча = Элемент.Ключ;
			КонецЕсли;
		
			Если ТипЗнч(Элемент.Значение) = Тип("Структура") 
				ИЛИ ТипЗнч(Элемент.Значение) = Тип("Соответствие")  Тогда
		
				ПоказатьНастройкиВРежимеОтладки(Элемент.Значение, ПредставлениеКлюча);	
			
			ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
				
				Лог.Отладка("	параметр <%1> = Массив.<%2>", ПредставлениеКлюча, Элемент.Значение.Количество());
				
				ПоказатьНастройкиВРежимеОтладки(Элемент.Значение, ПредставлениеКлюча);	
			
			Иначе
				Лог.Отладка("	параметр <%1> = <%2>", ПредставлениеКлюча, Элемент.Значение);
		
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;

	Лог.Отладка("	параметр <%1> = <%2>", Родитель, ЗначенияПараметров);
	
КонецПроцедуры
